alibaba/AliOS-Things/platform/mcu/lpc54628/drivers/fsl_clock.c
    return freq / ((SYSCON->USB0CLKDIV & 0xffU) + 1U);
}

/* Get USB1 Clk */
uint32_t CLOCK_GetUsb1ClkFreq(void)
{
    uint32_t freq = 0U;

    switch(SYSCON->USB1CLKSEL)
    {
        case 0U:
          freq = CLOCK_GetCoreSysClkFreq();
          break;
        case 1U:
          freq = CLOCK_GetPllOutFreq();
          break;
        case 2U:
          freq = CLOCK_GetUsbPllOutFreq();
          break;
        case 7U:
          freq = 0U;
          break;

        default:
          break;
    }

    return freq / ((SYSCON->USB1CLKDIV & 0xffU) + 1U);
}

/* Get MCLK Clk */
uint32_t CLOCK_GetMclkClkFreq(void)
{
    uint32_t freq = 0U;

    switch(SYSCON->MCLKCLKSEL)
    {
        case 0U:
          freq = CLOCK_GetFroHfFreq() / ((SYSCON->FROHFCLKDIV & 0xffu) + 1U);
          break;
        case 1U:
          freq = CLOCK_GetAudioPllOutFreq();
          break;
        case 7U:
          freq = 0U;
          break;

        default:
          break;
    }

    return freq / ((SYSCON->MCLKDIV & 0xffU) + 1U);
}

/* Get SCTIMER Clk */
uint32_t CLOCK_GetSctClkFreq(void)
{
    uint32_t freq = 0U;

    switch(SYSCON->SCTCLKSEL)
    {
        case 0U:
          freq = CLOCK_GetCoreSysClkFreq();
          break;
        case 1U:
          freq = CLOCK_GetPllOutFreq();
          break;
        case 2U:
          freq = CLOCK_GetFroHfFreq();
          break;
        case 3U:
          freq = CLOCK_GetAudioPllOutFreq();
          break;
        case 7U:
          freq = 0U;
          break;

        default:
          break;
    }

    return freq / ((SYSCON->SCTCLKDIV & 0xffU) + 1U);
}

/* Get SDIO Clk */
uint32_t CLOCK_GetSdioClkFreq(void)
{
    uint32_t freq = 0U;

    switch(SYSCON->SDIOCLKSEL)
    {
        case 0U:
          freq = CLOCK_GetCoreSysClkFreq();
          break;
        case 1U:
          freq = CLOCK_GetPllOutFreq();
          break;
        case 2U:
          freq = CLOCK_GetUsbPllOutFreq();
          break;
        case 3U:
          freq = CLOCK_GetFroHfFreq();
          break;
        case 4U:
          freq = CLOCK_GetAudioPllOutFreq();
          break;
        case 7U:
          freq = 0U;
          break;
        default:
          break;
    }

    return freq / ((SYSCON->SDIOCLKDIV & 0xffU) + 1U);
}

/* Get LCD Clk */
uint32_t CLOCK_GetLcdClkFreq(void)
{
    uint32_t freq = 0U;

    switch(SYSCON->LCDCLKSEL)
    {
        case 0U:
          freq = CLOCK_GetCoreSysClkFreq();
          break;
        case 1U:
          freq = CLOCK_GetLcdClkIn();
          break;
        case 2U:
          freq = CLOCK_GetFroHfFreq();
          break;
        case 3U:
          freq = 0U;
          break;

        default:
          break;
    }

    return freq / ((SYSCON->LCDCLKDIV & 0xffU) + 1U);
}

/* Get LCD CLK IN Clk */
uint32_t CLOCK_GetLcdClkIn(void)
{
  return s_Lcd_Clk_In_Freq;
}

/* Get FRO 12M Clk */
uint32_t CLOCK_GetFro12MFreq(void)
{
    return (SYSCON->PDRUNCFG[0] & SYSCON_PDRUNCFG_PDEN_FRO_MASK) ? 0U : 12000000U;
}

/* Get EXT OSC Clk */
uint32_t CLOCK_GetExtClkFreq(void)
{
    return s_Ext_Clk_Freq;
}

/* Get WATCH DOG Clk */
uint32_t CLOCK_GetWdtOscFreq(void)
{
    uint8_t freq_sel, div_sel;
    if (SYSCON->PDRUNCFG[0] & SYSCON_PDRUNCFG_PDEN_WDT_OSC_MASK)
    {
        return 0U;
    }
    else
    {
        div_sel = ((SYSCON->WDTOSCCTRL & 0x1f) + 1) << 1;
        freq_sel = wdtFreqLookup[((SYSCON->WDTOSCCTRL & SYSCON_WDTOSCCTRL_FREQSEL_MASK) >> SYSCON_WDTOSCCTRL_FREQSEL_SHIFT)];
        return ((uint32_t) freq_sel * 50000U)/((uint32_t)div_sel);
    }
}

/* Get HF FRO Clk */
uint32_t CLOCK_GetFroHfFreq(void)
{
    if ((SYSCON->PDRUNCFG[0] & SYSCON_PDRUNCFG_PDEN_FRO_MASK) || (!(SYSCON->FROCTRL & SYSCON_FROCTRL_HSPDCLK_MASK)))
    {
        return 0U;
    }

    if(SYSCON->FROCTRL & SYSCON_FROCTRL_SEL_MASK)
    {
        return 96000000U;
    }
    else
    {
        return 48000000U;
    }
}

/* Get SYSTEM PLL Clk */
uint32_t CLOCK_GetPllOutFreq(void)
{
    return s_Pll_Freq;
}

/* Get AUDIO PLL Clk */
uint32_t CLOCK_GetAudioPllOutFreq(void)
{
    return s_Audio_Pll_Freq;
}

/* Get USB PLL Clk */
uint32_t CLOCK_GetUsbPllOutFreq(void)
{
    return s_Usb_Pll_Freq;
}

/* Get RTC OSC Clk */
uint32_t CLOCK_GetOsc32KFreq(void)
{
    return CLK_RTC_32K_CLK;               /* Needs to be corrected to check that RTC Clock is enabled */
}

/* Get MAIN Clk */
uint32_t CLOCK_GetCoreSysClkFreq(void)
{
    uint32_t freq = 0U;

    switch(SYSCON->MAINCLKSELB)
    {
        case 0U:
            if(SYSCON->MAINCLKSELA == 0U)
            {
                freq = CLOCK_GetFro12MFreq();
            }
            else if(SYSCON->MAINCLKSELA == 1U)
            {
                freq = CLOCK_GetExtClkFreq();
            }
            else if(SYSCON->MAINCLKSELA == 2U)
            {
                freq = CLOCK_GetWdtOscFreq();
            }
            else if(SYSCON->MAINCLKSELA == 3U)
            {
                freq = CLOCK_GetFroHfFreq();
            }
            else
            {}
            break;
        case 2U:
            freq = CLOCK_GetPllOutFreq();
            break;

        case 3U:
            freq = CLOCK_GetOsc32KFreq();
            break;

        default:
            break;

    }

    return freq;
}

/* Get I2S MCLK Clk */
uint32_t CLOCK_GetI2SMClkFreq(void)
{
    return s_I2S_Mclk_Freq;
}

/* Get ASYNC APB Clk */
uint32_t CLOCK_GetAsyncApbClkFreq(void)
{
    async_clock_src_t clkSrc;
    uint32_t clkRate;

    clkSrc = CLOCK_GetAsyncApbClkSrc();

    switch (clkSrc)
    {
        case kCLOCK_AsyncMainClk:
            clkRate = CLOCK_GetCoreSysClkFreq();
            break;
        case kCLOCK_AsyncFro12Mhz:
            clkRate = CLK_FRO_12MHZ;
            break;
        default:
            clkRate = 0U;
            break;
    }

    return clkRate;
}

/* Get FLEXCOMM Clk */
uint32_t CLOCK_GetFlexCommClkFreq(uint32_t id)
{
    uint32_t freq = 0U;

    switch(SYSCON->FCLKSEL[id])
    {
        case 0U:
          freq = CLOCK_GetFro12MFreq();
          break;
        case 1U:
          freq = CLOCK_GetFroHfFreq();
          break;
        case 2U:
          freq = CLOCK_GetPllOutFreq();
          break;
        case 3U:
          freq = CLOCK_GetI2SMClkFreq();
          break;
        case 4U:
          freq = CLOCK_GetFrgClkFreq();
          break;

        default:
          break;
    }

    return freq;
}

/* Get FRG Clk */
uint32_t CLOCK_GetFRGInputClock(void)
{
    uint32_t freq = 0U;

    switch(SYSCON->FRGCLKSEL)
    {
        case 0U:
          freq = CLOCK_GetCoreSysClkFreq();
          break;
        case 1U:
          freq = CLOCK_GetPllOutFreq();
          break;
        case 2U:
          freq = CLOCK_GetFro12MFreq();
          break;
        case 3U:
          freq = CLOCK_GetFroHfFreq();
          break;

        default:
          break;
    }

    return freq;
}

/* Get FRG Clk */
uint32_t CLOCK_GetFrgClkFreq(void)
{
    uint32_t freq = 0U;

    switch (SYSCON->FRGCLKSEL)
    {
        case 0U:
            freq = CLOCK_GetCoreSysClkFreq();
            break;
        case 1U:
            freq = CLOCK_GetPllOutFreq();
            break;
        case 2U:
            freq = CLOCK_GetFro12MFreq();
            break;
        case 3U:
            freq = CLOCK_GetFroHfFreq();
            break;
        default:
            break;
    }

    return freq;
}

